Examples/Propeller/600rpm/system/functions/meanFields
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
#include 	"../../initialConditions"

meanFields
{
    type                fieldAverage;
    libs                ("libfieldFunctionObjects.so");
    
    

    fields
    (
        U{
            mean		yes;
            prime2Mean		no;
            base 		iteration;
        }
        p{
            mean        	yes;
            prime2Mean  	no;
            base		iteration;
        }
    );
    timeStart	    130;
    timeEnd	    150;
    executeControl  timeStep;
    writeControl    writeTime;
    enabled		true;
    log                 false;

    //periodicRestart     true;
    //restartPeriod       100;
}

// *********************************************************************** //
