Examples/Propeller/600rpm/system/functions/nearWallFields
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  8                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

// Interpolate U to create near-wall UNear
nearWallFields
{
    libs 		("libfieldFunctionObjects.so");
    type 		nearWallFields;
    writeControl    	writeTime;
    executeControl   	writeTime;

    fields
    (
        		(UMean UNear)		//(inputField outputField)
    );

    patches 		( Propeller_Group );
    distance 		0.001;
}

// *********************************************************************** //
