Examples/Propeller/600rpm/system/functions/residuals
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  8                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      residuals;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

residuals
{
    type            		solverInfo;
    libs 			("libutilityFunctionObjects.so");


    fields 			(p U k omega);

    writeResidualFields 	false;
    writeControl    		timeStep;
    writeInterval   		1;
}

// ************************************************************************* //
