Examples/Propeller/600rpm/system/functions/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      yPlus;
}
yPlus1
{
 // Mandatory entries (unmodifiable)
    type            yPlus;
    libs            ("libfieldFunctionObjects.so");


    // Optional (inherited) entries
    writeControl    	writeTime;
    executeControl   	writeTime;

}
