Examples/Propeller/600rpm/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default cellMDLimited leastSquares 1;
    grad(p) cellMDLimited Gauss linear 1;
    grad(U) cellMDLimited leastSquares 1;
}

divSchemes
{
    default         				none;
    div(phi,U)      				Gauss linearUpwindV grad(U);
    div(phi,k)     					Gauss upwind;
    div(phi,omega)  				Gauss upwind;
    div((nuEff*dev2(T(grad(U))))) 	Gauss linear;
}

laplacianSchemes
{
  //default         Gauss linear corrected;
    default         Gauss linear limited 0.5;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
   //default			corrected;
  default         limited 0.5;
}



wallDist
{
    method meshWave;
}

// ************************************************************************* //
